src/Catalogs/КИИ_МоделиИИ/КИИ_МоделиИИ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КИИ_МоделиИИ</name>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПоляТекста</name>
    <comment>Возможно content или text</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьЗащищенноеСоединение</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимумТокенов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПровайдера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Таймаут</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Температура</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипАвторизации</name>
    <type>
      <types>EnumRef.КИИ_ТипыАвторизации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипФорматаAPI</name>
    <type>
      <types>EnumRef.КИИ_ТипыФорматовAPI</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокЖизниКеша</name>
    <comment>TTL для записей кеша ответов ИИ в секундах. 0 = не использовать кеш для модели. Дефолт 86400 (24ч).</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияСхемыКеша</name>
    <comment>Версия контракта нормализации ключа кеша для этой модели. Инкремент = все старые записи кеша протухли. Дефолт 1.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипМодели</name>
    <comment>Чат / Эмбеддинг — разделение chat vs embedding.</comment>
    <type>
      <types>EnumRef.КИИ_ТипыМоделей</types>
    </type>
  </attributes>
  <attributes>
    <name>EndpointЭмбеддингов</name>
    <comment>Напр. /v1/embeddings (если ТипМодели=Эмбеддинг).</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерностьЭмбеддинга</name>
    <comment>1536/256.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксТокеновВхода</name>
    <comment>Лимит для чанкера.</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлассEgress</name>
    <comment>РФ/внешний — матчится с политикой документа.</comment>
    <type>
      <types>EnumRef.КИИ_ПолитикиЭмбеддинга</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПрокси</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоддерживаетИнструменты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимКонтроляПерсональныхДанных</name>
    <type>
      <types>EnumRef.КИИ_РежимыКонтроляПерсональныхДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>МаршрутДоверенный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтпечатокДоверенногоМаршрута</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Заголовки</name>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Enums/КИИ_ТипыМоделей/КИИ_ТипыМоделей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КИИ_ТипыМоделей</name>
  <comment>Разделение моделей ИИ по назначению: Чат (генерация) / Эмбеддинг (векторизация).</comment>
  <enumValues>
    <name>Чат</name>
  </enumValues>
  <enumValues>
    <name>Эмбеддинг</name>
  </enumValues>
</mdclass:Enum>

src/Catalogs/КИИ_МоделиИИ/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗагрузитьAPIКлюч();
	КонецЕсли;

	НастроитьЭлементыФормы();
	ОбновитьМаршрутПодключения();

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	СохранитьAPIКлюч(ТекущийОбъект.Ссылка);
	НастроитьЭлементыФормы();
	ОбновитьМаршрутПодключения();
	КИИ_КоннекторИИ.ОбеспечитьРегламентыОчистки();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НаименованиеПолноеПриИзменении(Элемент)

	НастройкиПодключенияПриИзменении(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПровайдераПриИзменении(Элемент)

	НастройкиПодключенияПриИзменении(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ТипМоделиПриИзменении(Элемент)

	НастройкиПодключенияПриИзменении(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ТипФорматаAPIПриИзменении(Элемент)

	НастройкиПодключенияПриИзменении(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура АдресПриИзменении(Элемент)

	НастройкиПодключенияПриИзменении(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьЗащищенноеСоединениеПриИзменении(Элемент)

	НастройкиПодключенияПриИзменении(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьПроксиПриИзменении(Элемент)

	НастройкиПодключенияПриИзменении(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура АдресЗапросаПриИзменении(Элемент)

	НастройкиПодключенияПриИзменении(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура EndpointЭмбеддинговПриИзменении(Элемент)

	НастройкиПодключенияПриИзменении(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ТипАвторизацииПриИзменении(Элемент)

	НастройкиПодключенияПриИзменении(Элемент);

КонецПроцедуры

&НаКлиенте
Процедура КлючAPIПриИзменении(Элемент)

	НастройкиПодключенияПриИзменении(Элемент);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПроверитьПодключение(Команда)

	Если ПроверкаВыполняется Тогда
		Возврат;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Или Модифицированность Тогда
		ПоказатьПредупреждение(, НСтр(
			"ru = 'Сначала запишите карточку. Проверка использует сохраненный адрес, авторизацию и модель.'"));
		Возврат;
	КонецЕсли;
	Если Не ПредыдущаяПроверкаЗавершена() Тогда
		РезультатПроверки = НСтр(
			"ru = 'Предыдущий запрос еще выполняется. Отмена ожидания не означает отмену запроса к сервису. Повторная
				|отправка пока недоступна.'");
		Возврат;
	КонецЕсли;
	ПроверкаВыполняется = Истина;
	Элементы.ФормаПроверитьПодключение.Доступность = Ложь;
	Оповещение = Новый ОписаниеОповещения("ПослеПодтвержденияПроверки", ЭтотОбъект, Объект.Ссылка);
	ПоказатьВопрос(Оповещение,
		НСтр("ru = 'Отправить тестовый запрос по сохраненным настройкам? Текст проверки будет передан сервису.
			|Сервис может списать токены или оплату. Для эмбеддингов будет проверено получение вектора; кеш ответа
			|не используется.'"),
		РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//@skip-check module-unused-method
&НаСервере
Процедура ЗагрузитьAPIКлюч()

	// Ключ доступен только пользователю, которому разрешено изменять модель.
	Если Не ПравоДоступа("Изменение", Метаданные.Справочники.КИИ_МоделиИИ) Тогда
		КлючAPI = "";
		Возврат;
	КонецЕсли;
	ПрежнийРежим = ПривилегированныйРежим();
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		КлючAPI = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Объект.Ссылка, "APIКлюч");
	Исключение
		УстановитьПривилегированныйРежим(ПрежнийРежим);
		КлючAPI = "";
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'КИИ.ЗагрузкаКлюча'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка, Метаданные.Справочники.КИИ_МоделиИИ, Объект.Ссылка,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	УстановитьПривилегированныйРежим(ПрежнийРежим);
	Если КлючAPI = Неопределено Тогда
		КлючAPI = "";
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СохранитьAPIКлюч(Знач СсылкаНаМодель)

	// БСП требует привилегий для хранилища, право на изменение модели проверяем заранее.
	Если Не ПравоДоступа("Изменение", Метаданные.Справочники.КИИ_МоделиИИ) Тогда
		Возврат;
	КонецЕсли;
	ЕстьКлюч = ЗначениеЗаполнено(КлючAPI);
	ПрежнийРежим = ПривилегированныйРежим();
	УстановитьПривилегированныйРежим(Истина);
	Попытка
		Если ЕстьКлюч Тогда
			ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище(СсылкаНаМодель, КлючAPI, "APIКлюч");
		Иначе
			ОбщегоНазначения.УдалитьДанныеИзБезопасногоХранилища(СсылкаНаМодель, "APIКлюч");
		КонецЕсли;
	Исключение
		УстановитьПривилегированныйРежим(ПрежнийРежим);
		Если ЕстьКлюч Тогда
			ТекстОшибки = СтрШаблон(НСтр("ru = 'Ошибка сохранения API ключа: %1'"),
				ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
		Событие = ?(ЕстьКлюч, НСтр("ru = 'КИИ.СохранениеКлюча'"), НСтр("ru = 'КИИ.УдалениеКлюча'"));
		ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.КИИ_МоделиИИ, СсылкаНаМодель,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	УстановитьПривилегированныйРежим(ПрежнийРежим);

КонецПроцедуры

&НаСервере
Процедура НастроитьЭлементыФормы()

	Элементы.КлючAPI.Видимость = ПравоДоступа("Изменение", Метаданные.Справочники.КИИ_МоделиИИ);

	Элементы.ФормаПроверитьПодключение.Доступность =
		ЗначениеЗаполнено(Объект.Ссылка) И Не ПроверкаВыполняется
		И ПравоДоступа("Изменение", Метаданные.Справочники.КИИ_МоделиИИ);

	СостояниеДоверия = ТекстСостоянияДоверия();
	Если ПустаяСтрока(РезультатПроверки) Тогда
		РезультатПроверки = НСтр(
			"ru = 'В этой карточке подключение еще не проверялось. Команда отправляет запрос к сервису после подтверждения.'");
	КонецЕсли;

КонецПроцедуры

// Отпечаток фиксируется при записи с включенным флажком; смена адреса, прокси или модели его аннулирует.
&НаСервере
Функция ТекстСостоянияДоверия()

	Если Не Объект.МаршрутДоверенный Тогда
		Возврат НСтр("ru = 'Запросы проверяются по режиму модели или канала.'");
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.ОтпечатокДоверенногоМаршрута) Тогда
		Возврат НСтр("ru = 'Маршрут станет доверенным после записи: будут зафиксированы адрес, прокси и модель.'");
	КонецЕсли;

	Если Объект.ОтпечатокДоверенногоМаршрута = КИИ_КонтрольПерсональныхДанных.ОтпечатокМаршрута(Объект) Тогда
		Возврат НСтр("ru = 'Доверие действует: запросы к этой модели уходят без контроля персональных данных.'");
	КонецЕсли;

	Возврат НСтр("ru = 'Доверие аннулировано: адрес, прокси или модель изменились после его выдачи.
		|Снимите флажок, запишите, установите снова - будет зафиксирован текущий маршрут.'");

КонецФункции

// Маршрут показывается по текущим полям; проверка выполняется только после записи.
&НаСервере
Процедура ОбновитьМаршрутПодключения()

	ЭтоЭмбеддинг = Объект.ТипМодели = Перечисления.КИИ_ТипыМоделей.Эмбеддинг;
	Элементы.EndpointЭмбеддингов.Видимость = ЭтоЭмбеддинг;
	Элементы.АдресЗапроса.Видимость = Не ЭтоЭмбеддинг;
	Элементы.СтраницаЭмбеддинг.Видимость = ЭтоЭмбеддинг;
	Путь = Объект.АдресЗапроса;
	Если Объект.ТипМодели = ПредопределенноеЗначение("Перечисление.КИИ_ТипыМоделей.Эмбеддинг") Тогда
		Путь = Объект.EndpointЭмбеддингов;
		Если ПустаяСтрока(Путь) Тогда
			Путь = "/v1/embeddings";
		КонецЕсли;
	КонецЕсли;
	ИтоговыйАдрес = ?(Объект.ИспользоватьЗащищенноеСоединение, "https://", "http://") + Объект.Адрес + Путь;
	Если ПустаяСтрока(Объект.Адрес) Тогда
		ИтоговыйАдрес = НСтр("ru = 'Сервер не указан'");
	КонецЕсли;
	Элементы.КлючAPI.Подсказка = НСтр(
		"ru = 'Ключ хранится в безопасном хранилище. Запись с пустым ключом удаляет сохраненный ключ.
			|OpenAI-совместимый локальный сервис может работать без ключа; для OAuth 2.0 нужны учетные данные
			|клиента.'");

КонецПроцедуры

&НаКлиенте
Процедура НастройкиПодключенияПриИзменении(Элемент)

	ОбновитьМаршрутПодключения();
	РезультатПроверки = НСтр("ru = 'Настройки изменены. Запишите карточку и выполните проверку заново.'");

КонецПроцедуры

&НаКлиенте
Процедура ПослеПодтвержденияПроверки(Ответ, Модель) Экспорт

	Если Ответ <> КодВозвратаДиалога.Да Тогда
		ПроверкаВыполняется = Ложь;
		Элементы.ФормаПроверитьПодключение.Доступность = Истина;
		Возврат;
	КонецЕсли;
	Если Модифицированность Или Объект.Ссылка <> Модель Тогда
		ПроверкаВыполняется = Ложь;
		Элементы.ФормаПроверитьПодключение.Доступность = Истина;
		РезультатПроверки = НСтр("ru = 'Карточка изменилась. Запишите ее и повторите проверку.'");
		Возврат;
	КонецЕсли;
	РезультатПроверки = НСтр("ru = 'Выполняется тестовый запрос...'");
	Попытка
		Операция = НачатьПроверку(Модель);
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ВыводитьСообщения = Ложь;
		ПараметрыОжидания.ТекстСообщения = НСтр("ru = 'Проверка подключения модели ИИ...'");
		Оповещение = Новый ОписаниеОповещения("ПослеПроверкиПодключения", ЭтотОбъект, Модель);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(Операция, Оповещение, ПараметрыОжидания);
	Исключение
		ПроверкаВыполняется = Ложь;
		Элементы.ФормаПроверитьПодключение.Доступность = Истина;
		РезультатПроверки = НСтр("ru = 'Не удалось запустить проверку. Подробности приведены в сообщении об ошибке.'");
		ВызватьИсключение;
	КонецПопытки;

КонецПроцедуры

&НаСервере
Функция НачатьПроверку(Знач Модель)

	Если Не ПредыдущаяПроверкаЗавершена() Тогда
		ВызватьИсключение НСтр("ru = 'Предыдущая проверка еще выполняется.'");
	КонецЕсли;
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Проверка подключения модели ИИ'");
	Операция = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения, "КИИ_КоннекторИИ.РезультатПроверкиПодключения", Модель);
	ЗаданиеПроверки = Строка(Операция.ИдентификаторЗадания);
	Возврат Операция;

КонецФункции

&НаСервере
Функция ПредыдущаяПроверкаЗавершена()

	Если ПустаяСтрока(ЗаданиеПроверки) Тогда
		Возврат Истина;
	КонецЕсли;
	Задание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(ЗаданиеПроверки));
	Возврат Задание = Неопределено Или Задание.Состояние <> СостояниеФоновогоЗадания.Активно;

КонецФункции

&НаКлиенте
Процедура ПослеПроверкиПодключения(Результат, Модель) Экспорт

	ПроверкаВыполняется = Ложь;
	Элементы.ФормаПроверитьПодключение.Доступность = Истина;
	Если Результат = Неопределено Тогда
		РезультатПроверки = НСтр(
			"ru = 'Ожидание отменено. Запрос к сервису может продолжаться; повторный запрос заблокирован до его завершения.'");
		Возврат;
	КонецЕсли;
	Если Результат.Статус = "Ошибка" Тогда
		РезультатПроверки = НСтр("ru = 'Проверка завершилась с ошибкой. Подробности доступны в журнале регистрации.'");
		Возврат;
	КонецЕсли;
	Итог = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	УдалитьИзВременногоХранилища(Результат.АдресРезультата);
	Если Объект.Ссылка <> Модель Тогда
		Возврат;
	КонецЕсли;
	РезультатПроверки = Строка(Итог.Дата) + Символы.ПС + Итог.Адрес + Символы.ПС
		+ ?(Итог.ЭтоОшибка, НСтр("ru = 'Проверка не пройдена: '") + Итог.ТекстОшибки, Итог.ТекстИтога);
	Если Модифицированность Тогда
		РезультатПроверки = РезультатПроверки + Символы.ПС + НСтр(
			"ru = 'Результат относится к сохраненным настройкам; в карточке есть несохраненные изменения.'");
	КонецЕсли;

КонецПроцедуры

#КонецОбласти
